   #                                                  Titanic Exercise 

   ![titanic](https://userscontent2.emaze.com/images/a5f68f37-6349-4065-a1fc-921cbe7401b2/958230111417e36d6b3c67ffd7bc3494.jpeg)
   #### Practise Pandas

First of all, import the needed libraries.

In [2]:
# Utilizaremos las siguientes librerías para el análisis
import pandas as pd
import numpy as np
from scipy import stats
import seaborn as sns
import matplotlib.pyplot as plt
import statistics

1. Read in filename and call the variable `titanic`
    - Explore the `titanic` dataset using `info`, `dtypes` & `describe`

In [3]:
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [10]:
titanic.shape

(891, 15)

In [6]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

2. Create a separate dataframe with the columns `['name', 'sex', 'age']`, call it `people`

It can be done two ways, do it both!

In [8]:

people = titanic[['who', 'sex', 'age']].copy()  # Select the specified columns and make a copy

print(people)

       who     sex   age
0      man    male  22.0
1    woman  female  38.0
2    woman  female  26.0
3    woman  female  35.0
4      man    male  35.0
..     ...     ...   ...
886    man    male  27.0
887  woman  female  19.0
888  woman  female   NaN
889    man    male  26.0
890    man    male  32.0

[891 rows x 3 columns]

3. Print the output of `people` showing the first three rows and the last four rows, using `append`,`tail` and `head`

In [11]:
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [13]:
titanic.tail(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

4. Slice the row from 3 to 9, call it `s_titanic`

In [15]:
# Select rows 3 to 9 (inclusive)
s_titanic = titanic.iloc[3:9,:]

print(s_titanic)

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third
5         0       3    male   NaN      0      0   8.4583        Q  Third
6         0       1    male  54.0      0      0  51.8625        S  First
7         0       3    male   2.0      3      1  21.0750        S  Third
8         1       3  female  27.0      0      2  11.1333        S  Third

     who  adult_male deck  embark_town alive  alone
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no   True
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False

5. Slice the row from 40 to 63 in reverse order, call it `s_titanic_rev`

In [16]:
# Slice rows 40 to 63 in reverse order
s_titanic_rev = titanic.iloc[40:64][::-1]  # Using [::-1] to reverse the order

print(s_titanic_rev)

    survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
63         0       3    male   4.0      3      2  27.9000        S   Third
62         0       1    male  45.0      1      0  83.4750        S   First
61         1       1  female  38.0      0      0  80.0000      NaN   First
60         0       3    male  22.0      0      0   7.2292        C   Third
59         0       3    male  11.0      5      2  46.9000        S   Third
58         1       2  female   5.0      1      2  27.7500        S  Second
57         0       3    male  28.5      0      0   7.2292        C   Third
56         1       2  female  21.0      0      0  10.5000        S  Second
55         1       1    male   NaN      0      0  35.5000        S   First
54         0       1    male  65.0      0      1  61.9792        C   First
53         1       2  female  29.0      1      0  26.0000        S  Second
52         1       1  female  49.0      1      0  76.7292        C   First
51         0       3    male  21.0      0      0   7.8000        S   Third
50         0       3    male   7.0      4      1  39.6875        S   Third
49         0       3  female  18.0      1      0  17.8000        S   Third
48         0       3    male   NaN      2      0  21.6792        C   Third
47         1       3  female   NaN      0      0   7.7500        Q   Third
46         0       3    male   NaN      1      0  15.5000        Q   Third
45         0       3    male   NaN      0      0   8.0500        S   Third
44         1       3  female  19.0      0      0   7.8792        Q   Third
43         1       2  female   3.0      1      2  41.5792        C  Second
42         0       3    male   NaN      0      0   7.8958        C   Third
41         0       2  female  27.0      1      0  21.0000        S  Second
40         0       3  female  40.0      1      0   9.4750        S   Third

      who  adult_male deck  embark_town alive  alone
63  child       False  NaN  Southampton    no  False
62    man        True    C  Southampton    no  False
61  woman       False    B          NaN   yes   True
60    man        True  NaN    Cherbourg    no   True
59  child       False  NaN  Southampton    no  False
58  child       False  NaN  Southampton   yes  False
57    man        True  NaN    Cherbourg    no   True
56  woman       False  NaN  Southampton   yes   True
55    man        True    C  Southampton   yes   True
54    man        True    B    Cherbourg    no  False
53  woman       False  NaN  Southampton   yes  False
52  woman       False    D    Cherbourg   yes  False
51    man        True  NaN  Southampton    no   True
50  child       False  NaN  Southampton    no  False
49  woman       False  NaN  Southampton    no  False
48    man        True  NaN    Cherbourg    no  False
47  woman       False  NaN   Queenstown   yes   True
46    man        True  NaN   Queenstown    no  False
45    man        True  NaN  Southampton    no   True
44  woman       False  NaN   Queenstown   yes   True
43  child       False  NaN    Cherbourg   yes  False
42    man        True  NaN    Cherbourg    no   True
41  woman       False  NaN  Southampton    no  False
40  woman       False  NaN  Southampton    no  False

6. Slice the columns from the starting column to `'parch'`, call it `left_columns`

In [17]:
left_columns = titanic.loc[:, :'parch']  # Select all columns up to 'parch'

print(left_columns)

     survived  pclass     sex   age  sibsp  parch
0           0       3    male  22.0      1      0
1           1       1  female  38.0      1      0
2           1       3  female  26.0      0      0
3           1       1  female  35.0      1      0
4           0       3    male  35.0      0      0
..        ...     ...     ...   ...    ...    ...
886         0       2    male  27.0      0      0
887         1       1  female  19.0      0      0
888         0       3  female   NaN      1      2
889         1       1    male  26.0      0      0
890         0       3    male  32.0      0      0

[891 rows x 6 columns]

7. Slice the columns from `'name'` to `'age'`, call it `middle_columns`

In [19]:
middle_columns = titanic.loc[:, 'class':'deck']  # Select columns between 'name' and 'age' (inclusive)

print(middle_columns)

      class    who  adult_male deck
0     Third    man        True  NaN
1     First  woman       False    C
2     Third  woman       False  NaN
3     First  woman       False    C
4     Third    man        True  NaN
..      ...    ...         ...  ...
886  Second    man        True  NaN
887   First  woman       False    B
888   Third  woman       False  NaN
889   First    man        True    C
890   Third    man        True  NaN

[891 rows x 4 columns]

8. Slice the columns from `'ticket'` to the end, call it `right_columns`

In [21]:
rigth_columns = titanic.loc[:, 'class':]  # Select columns between 'name' and 'age' (inclusive)

print(rigth_columns)

      class    who  adult_male deck  embark_town alive  alone
0     Third    man        True  NaN  Southampton    no  False
1     First  woman       False    C    Cherbourg   yes  False
2     Third  woman       False  NaN  Southampton   yes   True
3     First  woman       False    C  Southampton   yes  False
4     Third    man        True  NaN  Southampton    no   True
..      ...    ...         ...  ...          ...   ...    ...
886  Second    man        True  NaN  Southampton    no   True
887   First  woman       False    B  Southampton   yes   True
888   Third  woman       False  NaN  Southampton    no  False
889   First    man        True    C    Cherbourg   yes   True
890   Third    man        True  NaN   Queenstown    no   True

[891 rows x 7 columns]

9. What is the name of the oldest person who died in the Titanic? Was he or she travelling alone or had any family travelling with them?

In order to give an answer to the second question you should find out which columns give you that info. Usually part of your job as a Data Scientist will be get to know the dataset which you are working with. In this case the columns which give you that info are the following: 
        - 'sibsp' Number of Siblings/Spouses Aboard
        - 'parch' Number of Parents/Children Aboard

10. Create the list of 5 random numbers of rows from 0 to the lenght of the dataframe, call it `rows`

ex. `rows = [3,7,99,52,48]` use `random` library

This list of numbers are random, could be different.

11. Create the list of three column labels, call it `cols`

12. Use both lists `rows` and `cols` to create a new dataframe

13. Create a boolean array with the condition of being a woman or a man, using the `sex` column, where **female** is True. Call it `array_fe`

14. Rename the column `"sex"` to `"gender"` and filter the `titanic` dataframe with the boolean array, call it `woman_titanic`

15. How many woman were younger than 18? Call the variable `minor_wo`

16. How many woman that were less than 18 actually died? Call the variable `dead_wo`

17. Drop rows with *Nan* in `titanic` with `how='any'` and print the shape

18. Drop rows with *Nan* in `titanic` with `how='all'` and print the shape

Check in [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html) why the shapes are different.

19. Drop columns in `titanic` with more than 1000 missing values and print the columns remaining

20. Calculate the ratio of missing values at the `boat` column.

21.  Group `titanic` by `'pclass'` and aggregate by the columns `age` & `fare`, by `max` and `median` and assign it to `by_class`

22. Print the maximum age in each class from `by_class`

23. Print the median fare in each class from `by_class`

24. Using [`.pivot_table()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) to count how many women or men survived by class, call it `counted`.

Don't panic and read the documentation!

25. Add a new column with the sum of survived men and women, call it `counted['total']`

26. Sort `counted` by the `'total'` column. In which class the people survived the most?

27. Please, show only the rows using a mask with the following conditions: 
    - They are woman
    - From third class
    - Younger than 30
    - They survived
    
    ¿How many rows fulfill the condition?

28. Now, show only the rows using `.loc` with the following conditions: 
    - They are man
    - From first class
    - Older than 50
    - They died
    
    ¿How many rows fulfill the condition?

29. Print the uniques values at the column `'name'`

30. Find if was there any `name` repeated at the Titanic?

Hint: There were two people with the same name, who?

31. Using `matplotlib` find the appropriate visualization to show the distribution of the column `'age'`

32. Using `matplotlib` find the appropriate plot to visualize the column `'gender'`

32b. What if you also plot the column `'gender'` using the function [`countplot`](https://seaborn.pydata.org/generated/seaborn.countplot.html) from the library [`seaborn`](https://seaborn.pydata.org/)?

Remember you have never used `seaborn` before, therefore you should install it before importing it.

33. Using the function [`catplot`](https://seaborn.pydata.org/generated/seaborn.catplot.html) from the library `seaborn`, find out if the hypothesis _"Women are more likely to survive shipwrecks"_ is true or not.

34. Using [`kdeplot`]("https://seaborn.pydata.org/generated/seaborn.kdeplot.html") from `seaborn` represent those who not survived distributed by age.<>

Hint: First you should "filter" the `titanic` dataset where the column "survived" is 0, indexing the column `"age"` only.

Arguments you should pass to the function: 

    - color = "red"
    - label = "Not Survived"
    - shade = True
    
You should get something like this:

![kdeplot](./img/kdeplotsur.png)